---
kind: other
id: Methods.T:Autodesk.Revit.DB.ITransactionFinalizer
source: html/6a718ed7-2e34-a673-3fc0-d0e6eb8e83cf.htm
---
# ITransactionFinalizer Methods

This method is called at the end of committing a transaction